#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```
[command]/home/runner/work/_temp/ef8c0def-f6f1-4911-96e1-74b3c01e0f41/terraform-bin plan -no-color

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.http-server will be created
  + resource "google_compute_firewall" "http-server" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-http"
      + network            = "default"
      + priority           = 1000
      + project            = "student-00501"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "http-server",
        ]

      + allow {
          + ports    = [
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_instance.whizlabs will be created
  + resource "google_compute_instance" "whizlabs" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + creation_timestamp      = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "n1-standard-1"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            #!/bin/bash
            sudo apt-get update
            sudo apt-get install -y apache2
            echo 'Hello from Whizlabs' | sudo tee /var/www/html/index.html
            sudo service apache2 start
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "whizlabs-instance"
      + project                 = "student-00501"
      + self_link               = (known after apply)
      + tags                    = [
          + "http-server",
        ]
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                    = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "ubuntu-os-cloud/ubuntu-2204-lts"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = 10
              + snapshot               = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config (known after apply)

      + guest_accelerator (known after apply)

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity (known after apply)

      + scheduling (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_compute_firewall.http-server will be created%0A  + resource "google_compute_firewall" "http-server" {%0A      + creation_timestamp = (known after apply)%0A      + destination_ranges = (known after apply)%0A      + direction          = (known after apply)%0A      + enable_logging     = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "allow-http"%0A      + network            = "default"%0A      + priority           = 1000%0A      + project            = "student-00501"%0A      + self_link          = (known after apply)%0A      + source_ranges      = [%0A          + "0.0.0.0/0",%0A        ]%0A      + target_tags        = [%0A          + "http-server",%0A        ]%0A%0A      + allow {%0A          + ports    = [%0A              + "80",%0A            ]%0A          + protocol = "tcp"%0A        }%0A    }%0A%0A  # google_compute_instance.whizlabs will be created%0A  + resource "google_compute_instance" "whizlabs" {%0A      + can_ip_forward          = false%0A      + cpu_platform            = (known after apply)%0A      + creation_timestamp      = (known after apply)%0A      + current_status          = (known after apply)%0A      + deletion_protection     = false%0A      + effective_labels        = {%0A          + "goog-terraform-provisioned" = "true"%0A        }%0A      + id                      = (known after apply)%0A      + instance_id             = (known after apply)%0A      + label_fingerprint       = (known after apply)%0A      + machine_type            = "n1-standard-1"%0A      + metadata_fingerprint    = (known after apply)%0A      + metadata_startup_script = <<-EOT%0A            #!/bin/bash%0A            sudo apt-get update%0A            sudo apt-get install -y apache2%0A            echo 'Hello from Whizlabs' | sudo tee /var/www/html/index.html%0A            sudo service apache2 start%0A        EOT%0A      + min_cpu_platform        = (known after apply)%0A      + name                    = "whizlabs-instance"%0A      + project                 = "student-00501"%0A      + self_link               = (known after apply)%0A      + tags                    = [%0A          + "http-server",%0A        ]%0A      + tags_fingerprint        = (known after apply)%0A      + terraform_labels        = {%0A          + "goog-terraform-provisioned" = "true"%0A        }%0A      + zone                    = "us-central1-a"%0A%0A      + boot_disk {%0A          + auto_delete                = true%0A          + device_name                = (known after apply)%0A          + disk_encryption_key_sha256 = (known after apply)%0A          + guest_os_features          = (known after apply)%0A          + kms_key_self_link          = (known after apply)%0A          + mode                       = "READ_WRITE"%0A          + source                     = (known after apply)%0A%0A          + initialize_params {%0A              + architecture           = (known after apply)%0A              + image                  = "ubuntu-os-cloud/ubuntu-2204-lts"%0A              + labels                 = (known after apply)%0A              + provisioned_iops       = (known after apply)%0A              + provisioned_throughput = (known after apply)%0A              + resource_policies      = (known after apply)%0A              + size                   = 10%0A              + snapshot               = (known after apply)%0A              + type                   = (known after apply)%0A            }%0A        }%0A%0A      + confidential_instance_config (known after apply)%0A%0A      + guest_accelerator (known after apply)%0A%0A      + network_interface {%0A          + internal_ipv6_prefix_length = (known after apply)%0A          + ipv6_access_type            = (known after apply)%0A          + ipv6_address                = (known after apply)%0A          + name                        = (known after apply)%0A          + network                     = "default"%0A          + network_attachment          = (known after apply)%0A          + network_ip                  = (known after apply)%0A          + stack_type                  = (known after apply)%0A          + subnetwork                  = (known after apply)%0A          + subnetwork_project          = (known after apply)%0A%0A          + access_config {%0A              + nat_ip       = (known after apply)%0A              + network_tier = (known after apply)%0A            }%0A        }%0A%0A      + reservation_affinity (known after apply)%0A%0A      + scheduling (known after apply)%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_compute_firewall.http-server will be created%0A  + resource "google_compute_firewall" "http-server" {%0A      + creation_timestamp = (known after apply)%0A      + destination_ranges = (known after apply)%0A      + direction          = (known after apply)%0A      + enable_logging     = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "allow-http"%0A      + network            = "default"%0A      + priority           = 1000%0A      + project            = "student-00501"%0A      + self_link          = (known after apply)%0A      + source_ranges      = [%0A          + "0.0.0.0/0",%0A        ]%0A      + target_tags        = [%0A          + "http-server",%0A        ]%0A%0A      + allow {%0A          + ports    = [%0A              + "80",%0A            ]%0A          + protocol = "tcp"%0A        }%0A    }%0A%0A  # google_compute_instance.whizlabs will be created%0A  + resource "google_compute_instance" "whizlabs" {%0A      + can_ip_forward          = false%0A      + cpu_platform            = (known after apply)%0A      + creation_timestamp      = (known after apply)%0A      + current_status          = (known after apply)%0A      + deletion_protection     = false%0A      + effective_labels        = {%0A          + "goog-terraform-provisioned" = "true"%0A        }%0A      + id                      = (known after apply)%0A      + instance_id             = (known after apply)%0A      + label_fingerprint       = (known after apply)%0A      + machine_type            = "n1-standard-1"%0A      + metadata_fingerprint    = (known after apply)%0A      + metadata_startup_script = <<-EOT%0A            #!/bin/bash%0A            sudo apt-get update%0A            sudo apt-get install -y apache2%0A            echo 'Hello from Whizlabs' | sudo tee /var/www/html/index.html%0A            sudo service apache2 start%0A        EOT%0A      + min_cpu_platform        = (known after apply)%0A      + name                    = "whizlabs-instance"%0A      + project                 = "student-00501"%0A      + self_link               = (known after apply)%0A      + tags                    = [%0A          + "http-server",%0A        ]%0A      + tags_fingerprint        = (known after apply)%0A      + terraform_labels        = {%0A          + "goog-terraform-provisioned" = "true"%0A        }%0A      + zone                    = "us-central1-a"%0A%0A      + boot_disk {%0A          + auto_delete                = true%0A          + device_name                = (known after apply)%0A          + disk_encryption_key_sha256 = (known after apply)%0A          + guest_os_features          = (known after apply)%0A          + kms_key_self_link          = (known after apply)%0A          + mode                       = "READ_WRITE"%0A          + source                     = (known after apply)%0A%0A          + initialize_params {%0A              + architecture           = (known after apply)%0A              + image                  = "ubuntu-os-cloud/ubuntu-2204-lts"%0A              + labels                 = (known after apply)%0A              + provisioned_iops       = (known after apply)%0A              + provisioned_throughput = (known after apply)%0A              + resource_policies      = (known after apply)%0A              + size                   = 10%0A              + snapshot               = (known after apply)%0A              + type                   = (known after apply)%0A            }%0A        }%0A%0A      + confidential_instance_config (known after apply)%0A%0A      + guest_accelerator (known after apply)%0A%0A      + network_interface {%0A          + internal_ipv6_prefix_length = (known after apply)%0A          + ipv6_access_type            = (known after apply)%0A          + ipv6_address                = (known after apply)%0A          + name                        = (known after apply)%0A          + network                     = "default"%0A          + network_attachment          = (known after apply)%0A          + network_ip                  = (known after apply)%0A          + stack_type                  = (known after apply)%0A          + subnetwork                  = (known after apply)%0A          + subnetwork_project          = (known after apply)%0A%0A          + access_config {%0A              + nat_ip       = (known after apply)%0A              + network_tier = (known after apply)%0A            }%0A        }%0A%0A      + reservation_affinity (known after apply)%0A%0A      + scheduling (known after apply)%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A

::set-output name=stderr::

::set-output name=exitcode::0
```

</details>

*Pusher: @raulfuentesmanrique, Workflow: `Terraform CI`, Action: `pull_request`*